[
  ["alert text", "created by", "created at"],
  [
    "**** LOUISVILLE *****\n\nOnly James Kinsey and Butch Rohl are the tech sups and Royce Raleigh is the Ops Manager . ",
    "marcus",
    "2015-10-16 20:03:34",
    "  "
  ],
  [
    "****NEXT SOLUTIONS**** (Detroit)... Shea Rinard is on PTO until 8/20/2017... Call Jason Buchanan",
    "Finn",
    "2017-08-13 00:32:36",
    "  "
  ],
  [
    "***BLOOMINGTON*** Alt#\nScott Salter 1-309-306-1572\nDerek Smilgielski 1-708-320-8439",
    "Bless",
    "2015-11-17 07:17:46",
    "  "
  ],
  [
    "1/18/2017 Starting at NOON today and going forward until further notice all jobs that a customer, tech, or a sup is requesting to reschedule need to go thru JACK CRAMER via phone call. This applies for ANY RS and for ANY reason...\n\n1st point of contact - Jack Cramer\n2nd point of contact - Tech Supervisor\n3rd point of contact (only if you cannot reach the sup or Jack Cramer) - Chris Prewo\n\n*This applies for in-house jobs ONLY",
    "Finn",
    "2017-01-18 00:44:39",
    "  "
  ],
  [
    "All RESCHEDULES in Piscataway should be approved by OPS MGR James Doore",
    "Lance",
    "2016-11-19 05:07:13",
    "  "
  ],
  [
    "Baton Rouge \n\nMichael Buttke is a traveling sup and can give approval for status change.",
    "Lance",
    "2017-01-27 05:10:02",
    "  "
  ],
  [
    "BOSTON:\n\nCLAYTON LECLAIR IS OFF EVERY TUESDAY... THOMAS REXFORD IS COVERING",
    "asha",
    "2017-05-30 22:23:27",
    "  "
  ],
  [
    "Case Management - Customer Line: 800-442-1635; PIN: 2036",
    "Maegan",
    "2017-08-02 00:12:25",
    "  "
  ],
  [
    "CINCINNATI CONTRACTORS (MB000602) - Please call the following supervisors:\n\n\nOH01 - Lester Henderson/ Dave Hasting\nOH02 - Lester Henderson\nOH03 - Dave Hasting\nOH04 - Dave Hasting\nOH20 - Geoff Miyashiro",
    "xyza",
    "2015-07-25 20:54:40",
    "  "
  ],
  [
    "Digital Satellite (Tyler) - Thomas Dixon covers for Hal Luna every Sundays",
    "violet",
    "2016-07-24 22:46:54",
    "  "
  ],
  [
    "DW Direct Coverage in Houston Central\n\nJames Henry is on PTO until next week, Brittany Guardiola will cover for him.",
    "violet",
    "2017-08-04 20:29:06",
    "  "
  ],
  [
    "Empath (Detroit): If the job is for cancellation for any reason and has been confirmed with the customer, there’s no need to call the principal for approval. We can call principal if cust won't answer and any other status change. For FSRs, we still need to call principal.",
    "Finn",
    "2017-02-01 22:50:23",
    "  "
  ],
  [
    "Empath Detroit > Pls call Jon Kobeski for FSRs @ (586) 447-6118. We can also call him for approval for status change if Principal Steve Robinson wont answer.",
    "Barbie",
    "2016-09-18 00:22:55",
    "  "
  ],
  [
    "For all status change (MEMPHIS in NEXT SOLUTIONS only), please contact Jody Woods for approvals (only for today).",
    "Finn",
    "2017-08-26 21:14:15",
    "  "
  ],
  [
    "For Area 3, after calling Ops Mgr J. Rabalais for 2 attempts and you still can’t get hold of him call Gen. Mgr Malcolm Collins @ (901) 336-9989  before calling the Regional Director.\n\n(Alexandria, Baton Rouge, Lafayette LA, Champaign, Davenport, Peoria (Bloomington), Lafayette IN, Indianapolis IN, Cincinnati)",
    "lance",
    "2015-10-03 00:24:18",
    "  "
  ],
  [
    "TX10 IS NOW PART OF HOUSTON SOUTH. INFO FROM OPS JAMES BENNETT.",
    "asha",
    "2017-03-04 00:58:05",
    "  "
  ]
]
